Revit 2027 API
LightShape.Clone Method
 Creates a copy of the LightShape derived object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightShape Clone()
Public Function Clone As LightShape
public:
LightShape^ Clone()
member Clone : unit -> LightShape
Return Value
LightShape
See Also
Reference
LightShape Class
Autodesk.Revit.DB.Lighting Namespace